#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/private-henrique-percu/github-actions/runs/run-rMwtfZeFzvHgfvfj

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
aws_ecs_cluster.demo_ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-west-2:689210545704:cluster/demo_ecs_cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.demo_ecr will be created
  + resource "aws_ecr_repository" "demo_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "demo_ecs_repository"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Env"  = "demo"
          + "Name" = "demo_ecs_cluster"
        }
      + tags_all             = {
          + "Env"  = "demo"
          + "Name" = "demo_ecs_cluster"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @HenriquePercu, Action: `pull_request`*